Revit 2027 API
RebarSpliceRules.Create Method
 Creates a new instance of RebarSpliceRules with the default options.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static RebarSpliceRules Create(
	Document document
)
Public Shared Function Create (
	document As Document
) As RebarSpliceRules
public:
static RebarSpliceRules^ Create(
	Document^ document
)
static member Create :
        document : Document -> RebarSpliceRules
Parameters
document Document
 A document. The units in this document will be used to initialize default values.
Return Value
RebarSpliceRules
 Returns an instance of RebarSpliceRules with the default options.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarSpliceRules Class
Autodesk.Revit.DB.Structure Namespace